<center>
<img src="https://image.aladin.co.kr/product/12609/37/cover500/k372532974_1.jpg" width="200" height="200"><br>
</center>


 - Github: [PinkWink](https://github.com/PinkWink/DataScience)

### 1-2 파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas

파이썬에서는 이런 종류의 파일을 아주 손쉽게 읽을 수 있는 모듈이 있습니다. 바로 pandas라는 모듈입니다.

In [2]:
import pandas as pd

아마 앞으로도 위 코드처럼 대부분의 시작은 import로 할게 될 겁니다. 파이썬에서 원하는 모듈을 불러오는 명령이 import 입니다. 그 뒤에 원하는 모듈명을 넣게 됩니다. 모듈명 다음의 as는 as뒤에 붙는 pd 라는 짧은 단어로 pandas를 대체하겠다는 뜻입니다. 즉, pandas의 read_csv라는 의미로 pandas에서 CSV 파일을 읽는 명령은 read_csv입니다. 그 안에 한글을 사용하는 경우는 인코딩에서 신경 써야합니다. 우리가 받은 CCTV 데이터는 UTF-8로 인코딩이되어 있어서 read_csv 명령을 쓸 때 encoding 옵션에 UTF-8이라고 지정합니다. 이때 사용된 head()명령은 pandas 데이터의 첫 5행만 보여달라는 것입니다.

In [3]:
CCTV_Seoul = pd.read_csv('./data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

pnadas 데이터는 제일 첫 줄에 보이는 것이 해당하는 열(column)을 대표하는 일종의 제목입니다. 그래서 첫 줄을 특별히 column이라고 합니다. 데이터 뒤에 column의 이름들이 반환 됩니다.

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

그런데 기관명이라고 되어 있으니 이를 '구별'이라는 이름으로 하겠습니다. 이렇게 이름을 바꾸는 명령은 rename이라고 합니다. 그리고 그 명령 안에 사용된 inplace =True는 실제 CCTV_Seoul이라는 변수의 내용을 갱신하라는 의미입니다.

In [6]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace = True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

이제 두 번째 받은 엑셀 파일을 읽어야 합니다. 그 명령은 read_excel입니다. 그냥 인코딩만 지정하고 읽었더니 약간 이상합니다. 그것은 원본 엑셀 파일이 그림 1-8에서 보는 것처럼 첫 세줄이 열의 제목 처럼되어 있기 때문입니다.

In [31]:
pop_Seoul = pd.read_csv('./data/01. population_in_Seoul_1.csv', encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,"4,202,888","10,197,604","5,000,005","5,197,599","9,926,968","4,871,560","5,055,408","270,636","128,445","142,191",2.36,"1,321,458"
3,2017.1/4,종로구,"72,654","162,820","79,675","83,145","153,589","75,611","77,978","9,231","4,064","5,167",2.11,"25,425"
4,2017.1/4,중구,"59,481","133,240","65,790","67,450","124,312","61,656","62,656","8,928","4,134","4,794",2.09,"20,764"

데이터가 처음에 엑셀로 되어 있어서 csv로 변환 시켜주었다. 그러나 이는 보니 1~3행이 알수가 없어서 다음의 옵션을 주자.

In [32]:
pop_Seoul = pd.read_csv('./data/01. population_in_Seoul.csv',
                        header =2,
                        
                        encoding = 'utf-8')
pop_Seoul.head()

,기간,자치구,세대,계,남자,여자,계.1,남자.1,여자.1,계.2,남자.2,여자.2,세대당인구,65세이상고령자
0,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.0,1321458
1,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.0,25425
2,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.0,20764
3,2017.1/4,용산구,106544,244203,119132,125071,229456,111167,118289,14747,7965,6782,2.0,36231
4,2017.1/4,성동구,130868,311244,153768,157476,303380,150076,153304,7864,3692,4172,2.0,39997

출력된 모습도 간결하게 되었습니다. 그러나 컬럼의 이름에 문제가 있는 듯합니다. rename 명령을 사용해서 컬럼의 이름을 변경합니다.

In [33]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] :' 구별',
                          pop_Seoul.columns[1] : '인구수',
                          pop_Seoul.columns[2] : '한국인',
                          pop_Seoul.columns[3] : '외국인',
                          pop_Seoul.columns[4] : '고령자'}, inplace = True)

pop_Seoul.head()

,구별,인구수,한국인,외국인,고령자,여자,계.1,남자.1,여자.1,계.2,남자.2,여자.2,세대당인구,65세이상고령자
0,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.0,1321458
1,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.0,25425
2,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.0,20764
3,2017.1/4,용산구,106544,244203,119132,125071,229456,111167,118289,14747,7965,6782,2.0,36231
4,2017.1/4,성동구,130868,311244,153768,157476,303380,150076,153304,7864,3692,4172,2.0,39997

이제 어느 정도 정리된 것 같습니다. CCTV_Seoul이라는 변수에는 '구별 CCTV현황'을, pop_Seoul이라는 변수에는 '구별 인구 현황'을 저장했습니다. pandas에서 몇 줄 입력하지 않았는데 우리는 두 종류의 파일을 보기 좋게 읽게 되었습니다.

#### 1-3 pandas 기초 익히기

이 책이 목적을 이루는 과정을 더 중요하게 다루지만 그래도 책 전반에 걸쳐 pandas의 사용 빈도가 높아서 기초를 익히고 지나가겠습니다. 빠르게 진행할 테니 집중하세요. 그리고 본 절의 튜토리얼은 pandas의 튜토리얼이 다수 포함되어 있습니다.

In [34]:
import pandas as pd
import numpy as np

pandad 와 Numpy를 import했습니다. 이 두 모듈은 자주 사용되는 모듈이면서 둘을 함께 쓰면 유용할때가 많습니다.

In [35]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas의 데이터 유형 중 기초가 되는 것이 Series 입니다. 대괄호로 만드는 파이썬의 list 데이터로만 만들 수 있습니다. 중간에 NaN(Not A Number)도 넣었습니다.

In [36]:
dates = pd.date_range('20130101', periods = 6 )
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

또 pandas에는 날짜형의 데이터인 date_range가 있습니다. 기본 날짜를 지정하고 periods 옵션으로 6일간이라고 지정합니다.

In [37]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = ['A','B','C','D'])
                                                                
df

                   A         B         C         D
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878
2013-01-04  0.128024  0.650424 -0.575444  0.948507
2013-01-05  0.900202  0.077378  0.250078  1.238393
2013-01-06 -0.243783  0.879148  0.369375 -0.465051

이제 DataFrame 유형의 데이터를 만듭니다. 6행 4열의 random 변수를 만들고, 컬럼에는 columns=['A','B','C','D']로 지정하고, index 명령으로 코드 [11]에서 만든 날짜형 데이터인 dates를 index=dates 옵션을 이용해서 지정했습니다.

In [38]:
df.head(3)

                   A         B         C         D
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878

head() 명령을 사용하면 기본적으로 첫 5행을 보여줍니다. 괄호 안에 숫자를 넣어두면 그 숫자만큼의 행을 볼 수 있습니다.

In [39]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [40]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

그리고 index, columns 명령을 이용하면 pandas의 DataFrame의 컬럼과 인덱스를 확인할 수 있습니다.

In [41]:
df.values

array([[ 0.41097836,  0.37588031, -1.11962269, -0.6727379 ],
       [-0.57231616,  0.2130206 , -1.51262493,  1.7891806 ],
       [ 0.59093362,  0.69113655, -0.26433876,  0.53487835],
       [ 0.12802361,  0.65042424, -0.57544388,  0.94850729],
       [ 0.90020178,  0.0773778 ,  0.25007811,  1.23839333],
       [-0.24378255,  0.87914793,  0.36937465, -0.46505121]])

그리고 그 안에 들어가는 내용은 values 명령으로 확인할 수 있습니다. 또 info() 명령을 사용하면 DataFrame의 개요를 알 수 있습니다.

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

describe() 명령을 사용하면 통계적 개요를 확인 할 수 있습니다. 코드[19]에서처럼 개수(count)와 평균(mean)뿐만 아니라 min,max와 각 1/4지점, 표준편차까지 한 번에 알 수 있습니다.

In [43]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.202340  0.481165 -0.475430  0.562195
std    0.545195  0.308920  0.746375  0.968815
min   -0.572316  0.077378 -1.512625 -0.672738
25%   -0.150831  0.253736 -0.983578 -0.215069
50%    0.269501  0.513152 -0.419891  0.741693
75%    0.545945  0.680958  0.121474  1.165922
max    0.900202  0.879148  0.369375  1.789181

이때 values가 숫자가 아니라 문자라고 하더라고 그에 맞는 개요가 나타납니다.

In [44]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06 -0.243783  0.879148  0.369375 -0.465051
2013-01-03  0.590934  0.691137 -0.264339  0.534878
2013-01-04  0.128024  0.650424 -0.575444  0.948507
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-05  0.900202  0.077378  0.250078  1.238393

sort_values 명령은 by로 지정된 컬럼을 기준으로 정렬합니다. ascending 옵션을 사용하면 내림차순이나 오름차순으로 정렬시킬 수 있습니다.

In [45]:
df

                   A         B         C         D
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878
2013-01-04  0.128024  0.650424 -0.575444  0.948507
2013-01-05  0.900202  0.077378  0.250078  1.238393
2013-01-06 -0.243783  0.879148  0.369375 -0.465051

그냥 변수명을 적고 실행(shift+enter)하면 그 내용이 나타납니다. 내용이 너무 많은 경우는 jupyter notebook에서 내용을 줄여서 보여줍니다.

In [46]:
df['A']

2013-01-01    0.410978
2013-01-02   -0.572316
2013-01-03    0.590934
2013-01-04    0.128024
2013-01-05    0.900202
2013-01-06   -0.243783
Freq: D, Name: A, dtype: float64

DataFrame으로 선언된 변수의 경우 변수명 뒤에 ['A']와 같이 붙여주면 해당 컬럼만 Series로 보여줍니다. 물론 head()라는 명령이 있지만 중간부터 보고 싶다면 행의 범위만 지정해서 df[0:3]이라고 하면 됩니다.

In [47]:
df[0:3]

                   A         B         C         D
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878

만약 2013.01.02 부터 2013.01.04까지의 행을 보고 싶다면 df['20130102':20130104']라고 하면 됩니다.

In [48]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878
2013-01-04  0.128024  0.650424 -0.575444  0.948507

[11]에서 만든 dates 변수를 이용해서 특정 날짜의 데이터만 보고 싶으면 df.loc 명령을 사용하면 됩니다. loc는 location 옵션으로 슬라이싱(우리가 지금하고 있는 겁니다)할 때 loc 옵션을 이용해서 위치값을 지정할 수 있습니다.

In [49]:
df.loc[dates[0]]

A    0.410978
B    0.375880
C   -1.119623
D   -0.672738
Name: 2013-01-01 00:00:00, dtype: float64

A,B 열의 모든 행을 보고 싶다면 df.loc[:,['A','B']]라고 하면 됩니다.

In [50]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.410978  0.375880
2013-01-02 -0.572316  0.213021
2013-01-03  0.590934  0.691137
2013-01-04  0.128024  0.650424
2013-01-05  0.900202  0.077378
2013-01-06 -0.243783  0.879148

물론 행과 열의 범위를 모두 지정할 수도 있습니다.

In [51]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.572316  0.213021
2013-01-03  0.590934  0.691137
2013-01-04  0.128024  0.650424

2013년 1월 2일부터 2013년 1월 4일까지의 데이터 중 A와 B 컬럼의 데이터만 선택하는 것입니다.

In [28]:
df.loc['20130102',['A','B']]

A   -0.374971
B   -1.055063
Name: 2013-01-02 00:00:00, dtype: float64

또, 2013년 1월 2일의 A, B 컬럼의 내용을 확인하는 것입니다.

In [52]:
df.loc[dates[0], 'A']

0.4109783642803491

그리고 코드[11]에 있는 dates[0]에 맞는 날짜인 2013년 1월 1일에 A컬럼의 데이터만 확인할 수 있습니다. 그러나 loc 명령과 달리 행과 열의 번호를 이용해서 데이터에 바로 접근하고 싶을 수 있는데, 그 명령이 iloc입니다. iloc을 사용하면 행이나 열의 범위를 지정하면 됩니다. 특히 콜론(:)을 사용하면 전체를 의미합니다.

In [53]:
df.iloc[3]

A    0.128024
B    0.650424
C   -0.575444
D    0.948507
Name: 2013-01-04 00:00:00, dtype: float64

먼저 iloc에 단지 숫자만 표시하면 3번 행을 의미합니다(0번부터 시작하니까 4번 행이 됩니다.)

In [55]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.128024  0.650424
2013-01-05  0.900202  0.077378

또 3번째부터 5번째 앞, 즉 3번째부터 4번째까지 행과 0번부터 1번까지 열의 데이터만 가져올 수 있습니다.

In [56]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.572316 -1.512625
2013-01-03  0.590934 -0.264339
2013-01-05  0.900202  0.250078

또 범위가 아니라 콤마(,)로 행이나 열을 지정해서 데이터를 가져올 수 있습니다. 행이나 열에 대한 한쪽은 전체를 의미하게 하고 싶을 때는 그냥 콜란만 사용하면 됩니다.

In [57]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878

이렇게 행은 범위를 주고, 열은 콜론으로 전체를 의미하게 하는 것입니다.

In [59]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.375880 -1.119623
2013-01-02  0.213021 -1.512625
2013-01-03  0.691137 -0.264339
2013-01-04  0.650424 -0.575444
2013-01-05  0.077378  0.250078
2013-01-06  0.879148  0.369375

반대로 행을 전체로 선택했습니다. 다시 df를 호출하겠습니다.

In [60]:
df

                   A         B         C         D
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-02 -0.572316  0.213021 -1.512625  1.789181
2013-01-03  0.590934  0.691137 -0.264339  0.534878
2013-01-04  0.128024  0.650424 -0.575444  0.948507
2013-01-05  0.900202  0.077378  0.250078  1.238393
2013-01-06 -0.243783  0.879148  0.369375 -0.465051

DataFrame에서 특정 조건을 만족하는 데이터만 얻을 수 있습니다. 컬럼을 지정할 때 df['A']처럼 할 수도 있고, df.A 와 같이 할 수도 있습니다. 컬럼 A에서 0보다 큰 행만 얻는 것입니다.

In [61]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.410978  0.375880 -1.119623 -0.672738
2013-01-03  0.590934  0.691137 -0.264339  0.534878
2013-01-04  0.128024  0.650424 -0.575444  0.948507
2013-01-05  0.900202  0.077378  0.250078  1.238393

데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 됩니다.

In [62]:
df[df > 0 ]

                   A         B         C         D
2013-01-01  0.410978  0.375880       NaN       NaN
2013-01-02       NaN  0.213021       NaN  1.789181
2013-01-03  0.590934  0.691137       NaN  0.534878
2013-01-04  0.128024  0.650424       NaN  0.948507
2013-01-05  0.900202  0.077378  0.250078  1.238393
2013-01-06       NaN  0.879148  0.369375       NaN

DataFrame을 복사할 때는 그냥 = 기호를 이용해서 복사하면 실제 데이터의 내용이 복사되는 것이 아니라 데이터 위치만 복사되기 때문에 원본 데이터는 하나만 있게 됩니다.

In [63]:
df2 = df.copy()

데이터의 내용까지 복사하라는 지령은 copy() 옵션을 붙여 넣으면 됩니다.

In [64]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.410978  0.375880 -1.119623 -0.672738    one
2013-01-02 -0.572316  0.213021 -1.512625  1.789181    one
2013-01-03  0.590934  0.691137 -0.264339  0.534878    two
2013-01-04  0.128024  0.650424 -0.575444  0.948507  three
2013-01-05  0.900202  0.077378  0.250078  1.238393   four
2013-01-06 -0.243783  0.879148  0.369375 -0.465051  three

원래 있는 DataFrame에서 새로운 컬럼을 추가하는 것은 코드[39]에서처럼 하면 됩니다.

In [68]:
df2

                   A         B         C         D      E
2013-01-01  0.410978  0.375880 -1.119623 -0.672738    one
2013-01-02 -0.572316  0.213021 -1.512625  1.789181    one
2013-01-03  0.590934  0.691137 -0.264339  0.534878    two
2013-01-04  0.128024  0.650424 -0.575444  0.948507  three
2013-01-05  0.900202  0.077378  0.250078  1.238393   four
2013-01-06 -0.243783  0.879148  0.369375 -0.465051  three

In [69]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [1]:
test

NameError: name 'test' is not defined

In [1]:
test2

NameError: name 'test2' is not defined